src/cf/Catalogs/узИсторияКонфигураций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>узИсторияКонфигураций</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.узКонфигурации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВводВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.узЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИзмененныеОбъекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидИзменения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.узВидыИзменений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторОбъектаМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.узИдентификаторыОбъектовМетаданныхКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/узВидыИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>узВидыИзменений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Добавлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удален</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/узИсторияКонфигураций/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Если Параметры.Свойство("ДобавитьНовыйЭлемент") Тогда
			Объект.Владелец = Параметры.Конфигурация;
			Объект.Задача = Параметры.Задача;
			Объект.Комментарий = "#"+Формат(Объект.Задача.Код,"ЧГ=0") +" "+ Объект.Задача;
		Конецесли;
		Объект.ВводВручную = Истина;
		Объект.ДатаВерсии = ТекущаяДатаСеанса();
		Объект.ПользовательХранилища = Пользователи.ТекущийПользователь().узКороткоеИмя;				
	Конецесли;
	Если Объект.ВводВручную Тогда
		РазрешеноРедактировать = Истина;		
	Конецесли;
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьДоступность()
	Элементы.ГруппаРеквизиты.ТолькоПросмотр = Истина;
	Элементы.ГруппаСтраницы.ТолькоПросмотр = Истина;
	Если РазрешеноРедактировать Тогда
		Элементы.ГруппаРеквизиты.ТолькоПросмотр = Ложь;
		Элементы.ГруппаСтраницы.ТолькоПросмотр = Ложь;		
	Конецесли;
КонецПроцедуры 

&НаКлиенте
Процедура РазрешеноРедактироватьПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ВводВручнуюПриИзменении(Элемент)
	РазрешеноРедактировать = Истина;
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИзмененныеОбъектыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)	
	Если НоваяСтрока Тогда
		ПараметрыВвода = Новый Структура();
		ПараметрыВвода.Вставить("СтрокаИзмененныеОбъекты",Элемент.ТекущиеДанные);
		Подсказка = "Укажите полное имя изменненного объекта метаданных";
		Оповещение = Новый ОписаниеОповещения("ПослеВводаСтроки",ЭтаФорма , ПараметрыВвода);
		ПоказатьВводСтроки(Оповещение, "", Подсказка, 0, Истина); 
	Конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаСтроки(ПолноеИмяМетаданных, ПараметрыВвода) Экспорт
    Если ПолноеИмяМетаданных = Неопределено Тогда
        Возврат;
	КонецЕсли;
	
	СтрокаИзмененныеОбъекты = ПараметрыВвода.СтрокаИзмененныеОбъекты;	
	СтрокаИзмененныеОбъекты.ВидИзменения = ПредопределенноеЗначение("Перечисление.узВидыИзменений.Изменен");
	СтрокаИзмененныеОбъекты.ИдентификаторОбъектаМетаданных = ПолучитьИдентификаторОбъектаМетаданныхНаСервереБезКонтекста(ПолноеИмяМетаданных,Объект.Владелец);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьИдентификаторОбъектаМетаданныхНаСервереБезКонтекста(ПолноеИмяМетаданных,Конфигурация)
	ОбрОбъект = Обработки.узЗагрузкаИзмененийИзХранилища.Создать();
	ОбрОбъект.Конфигурация = Конфигурация;
	ОбрОбъект.ЗаполнитьмТЗСвойстваМетаданных();
	ОбрОбъект.СоздатьСтруктурумТЗПоискКэш();
	пИдентификаторОбъектаМетаданных = ОбрОбъект.ПолучитьИдентификаторОбъектаМетаданныхПоСтроке(ПолноеИмяМетаданных);
	Возврат пИдентификаторОбъектаМетаданных;
КонецФункции 

&НаКлиенте
Процедура ИзмененныеОбъектыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если НЕ ПроверитьЗаполнение() Тогда
		Отказ = Истина;
		Возврат;
	Конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("узИсторияХранилища_ЗаписанЭлемент");
КонецПроцедуры
